// 规则2、数组下标总是与指针的偏移量相同
//用a[i]这样的形式对数组进行访问，总是被编译器“改写”或解释为*(a+i)这样的指针访问
#include <stdio.h>


int main(int argc, char const *argv[])
{
    int a[10], *p, i;

    // 通过数组下标访问数组元素
    printf("通过数组下标访问数组元素\n");
    for (i = 0; i < 10; i++)
    {
        a[i] = i;
        printf("a[%d]=%d\n",i,a[i]);
    }

    //把指针名当做数组名，并使用下标访问
    p = a;
    printf("把指针名当做数组名，并使用下标访问\n");
    for (i = 0; i < 10; i++)
    {
        p[i] = i;
        printf("p[%d]=%d\n",i,p[i]);
    }

    // 利用指针偏移量访问数组元素，*表示取指针所在地址内容
    printf("利用指针偏移量访问数组元素，*表示取指针所在地址内容\n");
    p = a;
    for (i = 0; i < 10 ;i++)
    {
        *(p+i) = i;
        printf("*(p+%d)=%d\n", i, *(p+i));
    }

    return 0;
}











/*
运行结果
通过数组下标访问数组元素
a[0]=0
a[1]=1
a[2]=2
a[3]=3
a[4]=4
a[5]=5
a[6]=6
a[7]=7
a[8]=8
a[9]=9
把指针名当做数组名，并使用下标访问
p[0]=0
p[1]=1
p[2]=2
p[3]=3
p[4]=4
p[5]=5
p[6]=6
p[7]=7
p[8]=8
p[9]=9
利用指针偏移量访问数组元素，*表示取指针所在地址内容
*(p+0)=0
*(p+1)=1
*(p+2)=2
*(p+3)=3
*(p+4)=4
*(p+5)=5
*(p+6)=6
*(p+7)=7
*(p+8)=8
*(p+9)=9


*/
